{
  "butterfly": [
    {
      "id": "1",
      "name": "Mariposa Cola de Golondrina Jade",
      "sciname": "Papilio palinurus",
      "shortDescription": "Mariposa espectacular con alas verdes iridiscentes que brilla como una esmeralda al sol.",
      "longDescription": "La Papilio palinurus es una de las mariposas más hermosas del sudeste asiático. Sus alas posteriores presentan un verde metálico brillante con bandas negras que crean un efecto iridiscente único. Esta especie prefiere las áreas forestales tropicales donde se alimenta del néctar de diversas flores. Los machos son territoriales y a menudo se les ve patrullando su área en busca de hembras. Su vuelo es rápido y errático, lo que les ayuda a escapar de los depredadores.",
      "activity": "1",
      "status": "1",
      "region": "Sudeste Asiático",
      "location": "Malasia",
      "imageUrl": "https://www.publicdomainpictures.net/pictures/270000/velka/swallowtail-butterfly-1535402230kBD.jpg"
    },
    {
      "id": "2",
      "name": "Mariposa Emperador Púrpura",
      "sciname": "Apatura iris",
      "shortDescription": "Elegante mariposa con reflejos púrpuras que habita en bosques caducifolios de Asia Oriental.",
      "longDescription": "El Emperador Púrpura es conocido por su vuelo majestuoso y sus colores cambiantes. Los machos muestran un brillo púrpura intenso en sus alas cuando la luz los toca en el ángulo correcto. Prefieren alimentarse de savia de árboles fermentada, frutas podridas y ocasionalmente de excrementos, más que de flores. Son mariposas de dosel, pasando la mayor parte del tiempo en las copas de los árboles. Las hembras son más grandes y carecen del brillo púrpura de los machos.",
      "activity": "1",
      "status": "0",
      "region": "Asia Oriental",
      "location": "Japón",
      "imageUrl": "https://i.pinimg.com/originals/19/c0/2b/19c02bfeac54a22feaf25f3dd51932d7.jpg"
    },
    {
      "id": "3",
      "name": "Mariposa Atlas",
      "sciname": "Attacus atlas",
      "shortDescription": "Una de las mariposas más grandes del mundo, con alas que pueden alcanzar 28 cm de envergadura.",
      "longDescription": "La Mariposa Atlas es verdaderamente gigantesca y una de las especies más impresionantes de Asia. Sus alas presentan patrones complejos que incluyen 'ventanas' transparentes y diseños que imitan la cabeza de una serpiente en las puntas de las alas para disuadir a los depredadores. Los adultos no se alimentan y viven solo de las reservas acumuladas durante su etapa de oruga. Su ciclo de vida completo dura aproximadamente dos meses. Las orugas se alimentan de una gran variedad de plantas y pueden crecer hasta 12 cm de longitud.",
      "activity": "0",
      "status": "0",
      "region": "Sudeste Asiático",
      "location": "Tailandia",
      "imageUrl": "https://i.pinimg.com/originals/b4/a3/0c/b4a30c93ae6f957123805eb052f519f5.jpg"
    },
    {
      "id": "4",
      "name": "Mariposa Azul de Bengala",
      "sciname": "Lycaenidae bengalensis",
      "shortDescription": "Pequeña mariposa de color azul brillante endémica de las regiones montañosas de Asia del Sur.",
      "longDescription": "Esta diminuta joya azul es una especie endémica de las colinas de Bengala y regiones cercanas. A pesar de su pequeño tamaño, sus alas azul metálico la hacen fácilmente reconocible. Prefiere áreas con abundante vegetación y fuentes de agua cercanas. Las orugas tienen una relación simbiótica única con ciertas especies de hormigas, que las protegen a cambio de secreciones dulces. Los adultos se alimentan principalmente del néctar de flores pequeñas y son activos durante las horas más cálidas del día.",
      "activity": "1",
      "status": "2",
      "region": "Asia del Sur",
      "location": "India",
      "imageUrl": "https://hablemosdeinsectos.com/wp-content/uploads/2017/08/mariposa-azul-1-1024x768.jpg"
    },
    {
      "id": "5",
      "name": "Mariposa Hoja Seca",
      "sciname": "Kallima paralekta",
      "shortDescription": "Maestra del camuflaje, sus alas cerradas imitan perfectamente una hoja seca marchita.",
      "longDescription": "La Kallima paralekta es famosa por su extraordinario mimetismo. Cuando cierra sus alas, se vuelve prácticamente invisible al imitar una hoja seca caída, completa con 'nervaduras', manchas marrones y hasta agujeros simulados causados por insectos. Esta adaptación evolutiva la protege eficazmente de depredadores visuales. En contraste, el interior de sus alas muestra colores brillantes naranjas y azules. Habita en bosques tropicales húmedos donde se alimenta de frutas fermentadas y raramente visita flores.",
      "activity": "1",
      "status": "1",
      "region": "Sudeste Asiático",
      "location": "Myanmar",
      "imageUrl": "https://arc-anglerfish-arc2-prod-elcomercio.s3.amazonaws.com/public/4UMHVZSYVZBT3F4XTWHCA24VCQ.png"
    },
    {
      "id": "6",
      "name": "Mariposa Tigre del Himalaya",
      "sciname": "Danaus chrysippus himalayana",
      "shortDescription": "Subespecie resistente que migra a través de las altas montañas del Himalaya.",
      "longDescription": "Esta notable subespecie ha adaptado su comportamiento migratorio para navegar las condiciones extremas del Himalaya. Sus alas naranjas con bordes negros y puntos blancos la hacen reconocible a grandes distancias. Es conocida por sus increíbles migraciones estacionales, volando a altitudes que pueden superar los 3,000 metros. Se alimenta principalmente de plantas de la familia Asclepiadaceae, que le proporcionan compuestos tóxicos que la hacen desagradable para los depredadores. Su resistencia al frío es excepcional comparada con otras especies tropicales.",
      "activity": "1",
      "status": "1",
      "region": "Asia del Sur",
      "location": "Nepal",
      "imageUrl": "https://live.staticflickr.com/65535/50918024782_6b20efc825_b.jpg"
    },
    {
      "id": "7",
      "name": "Mariposa Lunar China",
      "sciname": "Actias ningpoensis",
      "shortDescription": "Mariposa nocturna de color verde pálido con elegantes colas en sus alas posteriores.",
      "longDescription": "La Actias ningpoensis es una polilla grande y hermosa que emerge solo durante las noches cálidas de primavera y verano. Sus alas verde pálido con intrincados patrones y largas colas la hacen inconfundible. Los machos tienen antenas plumosas más desarrolladas para detectar las feromonas de las hembras desde grandes distancias. Como muchas polillas grandes, los adultos no se alimentan y viven solo unas pocas semanas dedicadas exclusivamente a la reproducción. Las orugas se alimentan de hojas de diversos árboles caducifolios y pasan el invierno como pupas.",
      "activity": "0",
      "status": "0",
      "region": "Asia Oriental",
      "location": "China",
      "imageUrl": "https://www.thespruce.com/thmb/XoK9QcIOTWP09yDkYEXIkqzsloE=/2560x0/filters:no_upscale():max_bytes(150000):strip_icc()/85455257-56a709dc5f9b58b7d0e6347e.jpg"
    },
    {
      "id": "8",
      "name": "Mariposa Cebra de Longwing",
      "sciname": "Heliconius charithonia asiatica",
      "shortDescription": "Mariposa de vuelo lento con distintivas rayas blancas y negras que la hacen inconfundible.",
      "longDescription": "Esta elegante especie es conocida por su vuelo pausado y grácil, muy diferente al aleteo errático de otras mariposas. Sus alas alargadas con patrones de rayas blancas y negras la hacen fácilmente reconocible. A diferencia de muchas especies, puede vivir hasta 6 meses como adulto, una longevidad excepcional en el mundo de las mariposas. Se alimenta tanto de néctar como de polen, y las hembras pueden poner huevos durante varios meses. Es una especie gregaria que a menudo se agrupa para dormir.",
      "activity": "1",
      "status": "0",
      "region": "Sudeste Asiático",
      "location": "Indonesia",
      "imageUrl": "https://cdn.pixabay.com/photo/2015/01/03/20/20/zebra-longwing-587787_1280.jpg"
    },
    {
      "id": "9",
      "name": "Mariposa Ojo de Búho Gigante",
      "sciname": "Caligo memnon asiaticus",
      "shortDescription": "Impresionante mariposa con grandes ocelos que imitan ojos de búho en el reverso de sus alas.",
      "longDescription": "Una de las mariposas más impresionantes de Asia, famosa por los enormes ocelos en el reverso de sus alas posteriores que imitan perfectamente los ojos de un búho. Esta adaptación evolutiva la protege de depredadores al crear la ilusión de ser un animal mucho más grande y peligroso. Prefiere las horas del amanecer y atardecer para alimentarse de frutas fermentadas. Sus orugas son igualmente impresionantes, pudiendo alcanzar los 15 cm de longitud. Los adultos raramente visitan flores, prefiriendo la savia de árboles y frutas podridas.",
      "activity": "0",
      "status": "1",
      "region": "Sudeste Asiático",
      "location": "Filipinas",
      "imageUrl": "https://i.pinimg.com/originals/fa/a5/5d/faa55d07a837994c3bc1718aff0b7e5a.jpg"
    },
    {
      "id": "10",
      "name": "Mariposa Cristal del Bosque",
      "sciname": "Greta transparens orientalis",
      "shortDescription": "Extraordinaria mariposa con alas casi completamente transparentes, como cristal viviente.",
      "longDescription": "Una de las especies más únicas del mundo, sus alas son prácticamente transparentes con solo finas líneas de color marrón delimitando los bordes. Esta transparencia la hace casi invisible cuando vuela entre la vegetación densa del bosque tropical. Se alimenta exclusivamente de plantas que contienen alcaloides tóxicos, lo que la hace venenosa para los depredadores. Su vuelo es suave y silencioso, pareciendo más un fantasma que una mariposa real. Las hembras prefieren poner sus huevos en plantas jóvenes donde las orugas tendrán mejor acceso a los nutrientes.",
      "activity": "1",
      "status": "2",
      "region": "Sudeste Asiático",
      "location": "Brunéi",
      "imageUrl": "https://i.pinimg.com/originals/e0/f1/08/e0f10857c369bd87f09cdcfb98831c97.jpg"
    },
    {
      "id": "11",
      "name": "Mariposa Dragón Dorado",
      "sciname": "Troides helena cerberus",
      "shortDescription": "Majestuosa mariposa dorada considerada sagrada en muchas culturas asiáticas por su belleza.",
      "longDescription": "Conocida como la 'Reina de las Mariposas' en muchas culturas asiáticas, esta especie exhibe un dorado metálico brillante en sus alas que parece cambiar de intensidad según la luz. Los machos son altamente territoriales y pueden verse patrullando sus áreas durante horas. Su envergadura puede alcanzar los 19 cm, siendo una de las especies más grandes de la región. Se alimenta preferentemente de flores rojas y naranjas, y tiene una preferencia particular por las flores de hibisco. Las orugas se desarrollan exclusivamente en plantas de la familia Aristolochiaceae.",
      "activity": "1",
      "status": "1",
      "region": "Asia del Sur",
      "location": "Sri Lanka",
      "imageUrl": "https://live.staticflickr.com/8333/8436616633_e830240d61_b.jpg"
    },
    {
      "id": "12",
      "name": "Mariposa Sombra Nocturna",
      "sciname": "Erebus nocturnis himalayensis",
      "shortDescription": "Gran polilla nocturna de color negro azabache con patrones plateados que brillan bajo la luna.",
      "longDescription": "Esta impresionante polilla nocturna es una de las más grandes de Asia, con alas que pueden superar los 20 cm de envergadura. Su coloración negra profunda con intrincados patrones plateados la hace casi invisible en la oscuridad. Es conocida por su vuelo potente y directo, muy diferente al vuelo errático de otras polillas. Se siente atraída por luces artificiales pero también por ciertos aromas florales nocturnos. Los machos pueden detectar las feromonas de las hembras desde distancias superiores a los 5 kilómetros. Su ciclo de vida completo puede durar hasta dos años.",
      "activity": "0",
      "status": "0",
      "region": "Asia del Sur",
      "location": "Pakistán",
      "imageUrl": "https://i.pinimg.com/736x/a2/82/e0/a282e09cfc928385ef830a6aa57df8a8--taiwan-blue.jpg"
    },
    {
      "id": "13",
      "name": "Mariposa Arcoíris del Mekong",
      "sciname": "Chrysiridia ripheus mekongensis",
      "shortDescription": "Espectacular mariposa que refleja todos los colores del arcoíris en sus alas iridiscentes.",
      "longDescription": "Considerada una de las mariposas más hermosas del mundo, sus alas crean un espectáculo de colores iridiscentes que incluye verdes, azules, púrpuras y dorados, todos brillando simultáneamente. Este efecto se debe a la estructura microscópica de sus escamas, que refractan la luz de manera similar a un prisma. Es endémica de las regiones del río Mekong y está estrechamente ligada al ecosistema fluvial. Los machos establecen territorios cerca del agua donde realizan complejas danzas de cortejo. Desafortunadamente, su belleza la ha convertido en objetivo de coleccionistas, amenazando sus poblaciones naturales.",
      "activity": "1",
      "status": "2",
      "region": "Sudeste Asiático",
      "location": "Vietnam",
      "imageUrl": "https://www.ekologia.pl/wp-content/uploads/2023/03/max_chrysiridia_rhipheus.jpg"
    },
    {
      "id": "14",
      "name": "Mariposa Espejo de Plata",
      "sciname": "Argyreus hyperbius asiaticus",
      "shortDescription": "Elegante mariposa con manchas plateadas brillantes que parecen pequeños espejos en sus alas.",
      "longDescription": "Esta hermosa especie se caracteriza por las distintivas manchas plateadas en el reverso de sus alas, que brillan como pequeños espejos al sol. Es una especie migratoria que puede viajar cientos de kilómetros siguiendo las estaciones florales. Los machos son conocidos por su comportamiento de 'hilltopping', congregándose en las cimas de las colinas para buscar pareja. Se alimenta de una gran variedad de flores, pero muestra preferencia por las violetas silvestres. Las hembras son más grandes que los machos y pueden poner hasta 500 huevos durante su vida reproductiva.",
      "activity": "1",
      "status": "0",
      "region": "Asia Oriental",
      "location": "Mongolia",
      "imageUrl": "https://insectaintegration.com/wp-content/uploads/2021/11/%E6%96%90%E8%B1%B9%E8%9B%B1%E8%9D%B6-Argyreus-hyperbius-%E2%99%82-HNH3.jpg"
    },
    {
      "id": "15",
      "name": "Mariposa Fantasma del Bambú",
      "sciname": "Bambusia spectris orientalis",
      "shortDescription": "Misteriosa mariposa pálida que habita exclusivamente en bosques de bambú antiguos.",
      "longDescription": "Esta especie etérea es endémica de los bosques de bambú más antiguos de Asia, donde su coloración pálida y translúcida la hace parecer un fantasma entre las cañas. Se alimenta exclusivamente del néctar de flores de bambú, un evento que ocurre solo cada 65-120 años dependiendo de la especie de bambú. Esta dependencia extrema la convierte en una de las especies más vulnerables del continente. Su vuelo es silencioso y ondulante, adaptado perfectamente para navegar entre los densos tallos de bambú. Los adultos emergen solo durante la floración masiva del bambú, haciendo que las poblaciones sean cíclicas y predecibles.",
      "activity": "1",
      "status": "2",
      "region": "Asia Oriental",
      "location": "Corea del Sur",
      "imageUrl": "https://www.ifoundbutterflies.org/sites/default/files/2022-10/img_20220930_175753.jpg"
    }
  ]
}
